---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManager.Dispose
source: html/15cd3357-e8b7-6931-8806-5f8d14d7e44a.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.Dispose Method

Releases all resources used by the MacroManager

## Syntax (C#)
```csharp
public void Dispose()
```